from enum import Enum


class CharacterType(Enum):
    NONE = 'Не определена'
    ENTP = 'Искатель идей. Любознателен. Не рационален, независим.'
    ISFP = 'Эстетика, стремление к гармонии, получать удовольствие.'
    ESFJ = 'Человек общения. Оптимист. Энтузиаст.'
    INTJ = 'Аналитик, борьба за идею. Независимость.'
    ENFJ = 'Артист, мотиватор. Способен увлечься сам и увлечь других.'
    ISTJ = 'Человек системы, структуры. Желание все систематизировать.'
    INFP = 'Склонный к сопереживанию романтик. Конформист.'
    ESTP = 'Волевой организатор, любой ценой достигающий результата.'
    INTP = 'Формирует стратегический прогноз и следует ему. Критик.'
    ESFP = 'Неудержимое стремление быть лучшим из лучших.'
    ENTJ = 'Настроенный на преодоление первопроходец.'
    ISFJ = 'Хранитель и защитник моральных ценностей: дети, традиции.'
    ESTJ = 'Ответственный администратор стабильных участков.'
    INFJ = 'Быть чутким к людям, нравственность, сопереживание.'
    ISTP = 'Мастер своего дела, получающий удовольствие от работы.'
    ENFP = 'Инициатор. Находит людей с новыми возможностями.'
